docs/architecture/export/structurizr-Contenedores.mmd
graph LR
  linkStyle default fill:#ffffff

  1(["<b>Atleta</b><br/><i>[Person]</i>"])
  style 1 fill:#ffffff,stroke:#2E7D32,stroke-width:3px,color:#2E7D32

  2["<b>Servicio de Mapas</b><br/><i>[Software System]</i>"]
  style 2 fill:#ffffff,stroke:#E65100,stroke-width:3px,color:#E65100

  subgraph diagram ["RaceFlow [Software System]"]
    direction LR
    style diagram fill:#ffffff,stroke:#1565C0,stroke-width:2px,color:#1565C0

    5["<b>Web Application</b><br/><i>[Container: React + TS + Leaflet]</i>"]
    style 5 fill:#ffffff,stroke:#1565C0,stroke-width:2px,color:#1565C0
    6["<b>API Gateway</b><br/><i>[Container: Spring Cloud Gateway]</i><br/>2 workers"]
    style 6 fill:#ffffff,stroke:#1565C0,stroke-width:2px,color:#1565C0
    7["<b>Auth Service</b><br/><i>[Container: Java 21 + Spring Boot]</i><br/>registro, login, JWT, gRPC :9090"]
    style 7 fill:#ffffff,stroke:#1565C0,stroke-width:2px,color:#1565C0
    8["<b>Room Service</b><br/><i>[Container: Java 21 + Spring Boot]</i>"]
    style 8 fill:#ffffff,stroke:#1565C0,stroke-width:2px,color:#1565C0
    9["<b>Realtime / Ranking Service</b><br/><i>[Container: Java 21 + Spring Boot]</i><br/>fijado a 1 instancia"]
    style 9 fill:#ffffff,stroke:#1565C0,stroke-width:2px,color:#1565C0
    16["<b>Session / History Service</b><br/><i>[Container: Java 21 + Spring Boot]</i>"]
    style 16 fill:#ffffff,stroke:#1565C0,stroke-width:2px,color:#1565C0
    17["<b>Metrics Service</b><br/><i>[Container: Java 21 + Spring Boot]</i>"]
    style 17 fill:#ffffff,stroke:#1565C0,stroke-width:2px,color:#1565C0
    18["<b>Event Bus</b><br/><i>[Container: RabbitMQ]</i>"]
    style 18 fill:#ffffff,stroke:#1565C0,stroke-width:2px,color:#1565C0
    19[("<b>Estado en memoria</b><br/><i>[Container: Redis]</i>")]
    style 19 fill:#ffffff,stroke:#1565C0,stroke-width:2px,color:#1565C0
    20[("<b>Auth DB</b><br/><i>[Container: PostgreSQL]</i>")]
    style 20 fill:#ffffff,stroke:#1565C0,stroke-width:2px,color:#1565C0
    21[("<b>Room DB</b><br/><i>[Container: PostgreSQL]</i>")]
    style 21 fill:#ffffff,stroke:#1565C0,stroke-width:2px,color:#1565C0
    22[("<b>Session DB</b><br/><i>[Container: PostgreSQL]</i>")]
    style 22 fill:#ffffff,stroke:#1565C0,stroke-width:2px,color:#1565C0
    23[("<b>Metrics DB</b><br/><i>[Container: PostgreSQL]</i>")]
    style 23 fill:#ffffff,stroke:#1565C0,stroke-width:2px,color:#1565C0
  end

  1 -. "Accede [HTTPS]" .-> 5
  5 -. "Tiles [HTTPS]" .-> 2
  5 -. "REST [JSON/HTTPS]" .-> 6
  5 -. "Canal DIRECTO [WSS]" .-> 9
  6 -. "Autenticación" .-> 7
  6 -. "Gestión de salas" .-> 9
  6 -. "Historial" .-> 16
  6 -. "KPIs" .-> 17
  9 -. "getProfile(email) [gRPC :9090]" .-> 7
  9 -. "Redis protocol" .-> 19
  7 -. "JDBC" .-> 20
  8 -. "JDBC" .-> 21
  16 -. "JDBC" .-> 22
  17 -. "JDBC" .-> 23
  8 -. "AMQP" .-> 18
  9 -. "AMQP" .-> 18
  18 -. "AMQP" .-> 16
  18 -. "AMQP" .-> 17
